{
  "original_file": "jobs_data.json",
  "rewritten_at": "2025-08-20T16:32:49",
  "total_jobs": 27,
  "jobs": [
    {
      "id": 5,
      "date": "20 August 2025",
      "job_title": "RECEPTIONIST",
      "nature_of_job": "FULL TIME",
      "industry": "EDUCATION",
      "salary": "KSHS. 20,000-25,000",
      "job_location": "BURUBURU",
      "duties_and_responsibilities": "Front Desk Operations\n\nWarmly welcome and professionally greet visitors, parents, and students upon their arrival.\nGuide guests to the appropriate areas and oversee adherence to school security procedures during sign-in and sign-out.\nHandle incoming phone calls with courtesy and efficiency, directing them as needed.\nPromptly address inquiries via phone, email, or face-to-face interactions.\n\nAdministrative Assistance\n\nUpdate and manage student and visitor records as necessary.\nMaintain current school calendars and schedule appointments for school staff.\nAid the administrative team with tasks such as filing, photocopying, printing, and data input.\nManage mail distribution and coordinate school supplies and parcel logistics.\n\nCommunication & Collaboration\n\nFacilitate parent-teacher communication as required.\nCompose basic correspondence and circulars under the guidance of school administrators.\nParticipate in the planning and execution of school events, parent-teacher conferences, and open houses.\n\nOffice Operations\n\nMonitor inventory levels and reorder office and stationery supplies when needed.\nEnsure the front office area remains tidy, organized, and inviting at all times.\nSafeguard the confidentiality of sensitive information consistently.\n\nQualifications:\n- Fulfill all specified requirements and qualifications\n- Retain the same job responsibilities and scope\n- Utilize varied wording and format\n- Maintain a professional and compelling tone\n- Preserve salary, location, and contact details\n- Offer detailed and thorough information\n- Enhance SEO-friendliness and uniqueness for optimal Google visibility",
      "key_requirements_skills_qualification": "Qualifications:\n- Possess a diploma in Front Office Operations, Business Administration, or a relevant discipline\n- Have at least 2 years of hands-on experience in roles such as front office, receptionist, or customer service\n- Proficiency in utilizing Microsoft Office Suite applications including Word, Excel, and Outlook\n- Demonstrated strong verbal and written communication abilities in both English and Kiswahili\n- Exhibit exceptional interpersonal skills and maintain a welcoming and friendly disposition\n- Capable of handling multiple tasks simultaneously, maintaining organization, and performing effectively under pressure within a dynamic school setting\n- Familiarity with educational environments or experience working with children is a valuable asset\n\nThese qualifications are essential for the successful candidate to excel in the position.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 6,
      "date": "20 August 2025",
      "job_title": "CHEF",
      "nature_of_job": "FULL TIME",
      "industry": "EDUCATION",
      "salary": "KSHS. 20,000-25,000",
      "job_location": "BURUBURU",
      "duties_and_responsibilities": "Job Duties and Responsibilities:\n1. Craft and prepare daily meals (including breakfast, lunch, and snacks) in accordance with the school menu and individual student dietary needs.\n2. Ensure that all meals are not only nutritionally balanced and age-appropriate but also visually enticing to captivate children's appetites.\n3. Uphold impeccable standards of sanitation and cleanliness across all food preparation and serving zones.\n4. Oversee and mentor kitchen support staff to guarantee smooth operations and foster their professional growth.\n5. Manage kitchen stock levels, monitor usage, and strategically procure ingredients and supplies within budget and time constraints.\n6. Implement strategies to reduce food wastage and optimize resource utilization.\n7. Collaborate with school management to design and revise weekly and monthly menus that align with dietary guidelines and preferences.\n8. Cater to students with specific dietary needs, including allergies, ensuring their meals are safe and enjoyable.\n9. Coordinate meal schedules effectively to ensure punctual service during school breaks and lunch hours.\n10. Maintain meticulous records of daily meal counts, ingredient consumption, and hygiene assessments.\n11. Assist in food preparation for school functions, meetings, and extracurricular events.\n12. Communicate with suppliers to uphold the quality and freshness of food supplies received.\n13. Enforce compliance with health and safety regulations as mandated by the Ministry of Health and local public health authorities.\n14. Report any kitchen equipment malfunctions promptly and oversee their proper maintenance.\n15. Attend scheduled school meetings and contribute insights on kitchen operations.\n\nRequirements:\n- Adhere to specific qualifications and requirements.\n- Retain the same job scope and duties.\n- Utilize varied vocabulary and structure.\n- Ensure a professional and engaging tone.\n- Maintain existing salary, location, and contact details.\n- Provide detailed and comprehensive information.\n- Optimize content for SEO and uniqueness for search engine indexing.",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possess at least 2 years of hands-on experience as a chef or cook in a fast-paced culinary environment (prior involvement in a school or institutional kitchen is a plus)\n- Demonstrated expertise in preparing a diverse array of local and international dishes\n- Familiarity with child nutrition guidelines and food allergy protocols is highly valued\n- Hold a recognized certification or diploma in Culinary Arts, Food Production, or a related field\n- Stay current with food safety practices, hygiene protocols, and sanitation regulations (e.g., Public Health Certification)\n- Exhibit exceptional organizational abilities and effective time management skills\n- Capable of thriving in high-pressure situations and adept at handling multiple responsibilities",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 7,
      "date": "20 August 2025",
      "job_title": "REGIONAL SALES EXECUTIVES",
      "nature_of_job": "FULL TIME",
      "industry": "LUBRICANTS",
      "salary": "KSHS.75,000",
      "job_location": "NAIROBI, MT. KENYA, RIFT VALLEY, WESTERN & NYANZA",
      "duties_and_responsibilities": "Territory Sales Growth Specialist\n\nEvaluate the dynamic regional market landscape to pinpoint lucrative sales territories.\nCraft an intricate territorial blueprint outlining objectives, customer segments, and revenue forecasts.\nUtilize data and on-the-ground insights to pivot strategies according to localized market demands.\n\nProspective Client Engagement Expert\n\nIdentify and connect with potential clientele via cold calls, in-person visits, online outreach, and networking endeavors.\nEngage in consultative sales dialogues to grasp customer requirements and propose tailored solutions.\nDevelop personalized proposals and secure deals within designated timelines.\n\nStrategic Key Account Oversight\n\nNurture enduring relationships with pivotal clients through regular touchpoints and service evaluations.\nServe as a primary contact for issue escalations, ensuring client contentment and loyalty.\nDrive revenue growth by promoting supplementary products/services to existing accounts.\n\nRevenue Target Attainment Specialist\n\nTake charge of meeting monthly, quarterly, and annual sales objectives.\nSustain a steady sales pipeline and predict revenue contributions accurately.\nLeverage tools such as CRM systems, dashboards, and monitoring mechanisms to track progress and enhance performance.\n\nMarket Insight & Competitive Evaluation\n\nAmass intelligence on competitor product offerings, pricing tactics, and market trends.\nOffer insights to the marketing and product teams for enhancing value propositions.\nIdentify emerging market trends and communicate potential risks or opportunities proactively.\n\nCollaboration & Interdepartmental Coordination\n\nCollaborate closely with internal departments — marketing, operations, finance, and customer service — to ensure seamless order processing and post-sales support.\nContribute innovative concepts to campaigns, product launches, or region-specific marketing initiatives.\nEnsure adherence to company regulations, credit terms, and operational protocols.\n\nData Compilation & Reporting\n\nMaintain updated CRM and reporting platforms with call records, client engagements, and lead/deal statuses.\nSubmit regular activity summaries encompassing funnel metrics, win/loss evaluations, and travel schedules.\nParticipate in routine sales assessments to present territorial performance reports.\n\nRegional Brand Representation Specialist\n\nServe as the face of the company at local trade expos, industry gatherings, and client rendezvous.\nCultivate a robust brand presence in the area through ethical practices and professional interactions.\nPromote brand awareness by educating clients and prospects on the company's value propositions.\n\nRequirements:\n- Fulfill all specified qualifications and criteria\n- Retain the identical job duties and obligations\n- Employ distinct verbiage and structure\n- Maintain a professional and captivating tone\n- Preserve the existing salary, location, and contact details\n- Ensure content is exhaustive and detailed\n- Optimize content for SEO and ensure uniqueness for search engine indexing",
      "key_requirements_skills_qualification": "Qualifications:\n- Bachelor's degree in Business Administration, Marketing, or a related field of study.\n- A track record of 3 to 5 years in successful regional or territory sales within the energy and lubricants industry.\n- Possession of a valid driver's license is mandatory.\n- Proven ability to consistently achieve or surpass sales targets.\n- Proficient in customer relationship management and skilled in negotiation strategies.\n- Exceptional verbal and written communication, presentation, and interpersonal abilities.\n- Self-driven, impeccably organized, and capable of working autonomously.\n- Proficiency in utilizing MS Office Suite and CRM platforms such as Salesforce, Zoho, or HubSpot.\n- Willingness to undertake frequent travel within the designated region.\n- Open to relocation or assignment to any location across the country.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 8,
      "date": "20 August 2025",
      "job_title": "CHEF",
      "nature_of_job": "FULL TIME",
      "industry": "EDUCATION",
      "salary": "KSHS. 20,000-25,000",
      "job_location": "BURUBURU",
      "duties_and_responsibilities": "Job Duties and Responsibilities:\n\nCraft and prepare daily meals (including breakfast, lunch, and snacks) in accordance with the school menu and individual student dietary specifications.\nEnsure that meals are well-balanced, age-appropriate, and visually enticing to children.\nUphold stringent standards of cleanliness and hygiene in all food preparation and service zones.\nSupervise and mentor kitchen support staff to ensure smooth operations and foster their professional growth.\nManage kitchen inventory, oversee usage tracking, and uphold optimal stock levels.\nEfficiently procure ingredients and supplies while considering timeliness and cost-effectiveness.\nMonitor food wastage and implement strategies to reduce losses effectively.\nCollaborate with school management to develop and refresh weekly and monthly menus, aligning them with nutritional guidelines.\nAccommodate students with food allergies or specific dietary needs.\nCoordinate meal schedules to ensure prompt service during school breaks and lunch periods.\nMaintain meticulous records of daily meal tallies, ingredient consumption, and hygiene assessments.\nAssist in food preparation for school functions, meetings, and extracurricular activities.\nEngage with suppliers to ensure the quality and freshness of food deliveries.\nAdhere to health and safety regulations as dictated by the Ministry of Health and local public health standards.\nPromptly report any equipment issues and oversee the proper upkeep of kitchen appliances.\nAttend regular school meetings, offering insights and feedback on kitchen operations.\n\nRequirements:\n- Fulfill all relevant qualifications and credentials.\n- Retain the same scope of duties and responsibilities.\n- Utilize diverse terminology and structure for enhanced readability.\n- Maintain a professional and captivating tone.\n- Retain existing salary, location, and contact details.\n- Ensure comprehensive and detailed content.\n- Optimize content for SEO and uniqueness to enhance Google search visibility.",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possess a minimum of 2 years' hands-on experience as a chef or cook in a fast-paced culinary environment (previous work in a school or institutional kitchen is a valuable asset)\n- Demonstrated proficiency in preparing a diverse array of local and international dishes\n- Familiarity with child nutrition principles and food allergy management is highly preferred\n- Hold a certification or diploma in Culinary Arts, Food Production, or a related field\n- Stay updated on food safety protocols, hygiene practices, and sanitation guidelines, such as maintaining a valid Public Health Certification\n- Exhibit strong organizational capabilities and effective time management skills\n- Capable of thriving in high-pressure situations and adept at multitasking",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 9,
      "date": "20 August 2025",
      "job_title": "CHEF",
      "nature_of_job": "FULL TIME",
      "industry": "EDUCATION",
      "salary": "KSHS. 20,000-25,000",
      "job_location": "BURUBURU",
      "duties_and_responsibilities": "Job Duties and Responsibilities:\n\nCraft and prepare daily meals (including breakfast, lunch, and snacks) as per the school menu and tailored to meet student dietary preferences and restrictions.\nEnsure that all meals are well-balanced, age-appropriate, and visually enticing for children.\nUphold stringent hygiene and cleanliness standards across all food preparation and serving zones.\nSupervise and mentor kitchen assistants to optimize workflow efficiency and foster their professional growth.\nOversee kitchen inventory management, diligently tracking usage patterns and maintaining optimal stock levels.\nEfficiently procure ingredients and supplies, prioritizing timeliness and cost-effectiveness.\nMonitor food wastage closely and implement strategies to curtail losses effectively.\nCollaborate with school management to craft and update weekly and monthly menus that adhere to nutritional guidelines.\nAccommodate students with food allergies or special dietary needs sensitively and effectively.\nCoordinate meal timings to ensure prompt service during school breaks and lunch periods.\nMaintain meticulous records of daily meal tallies, ingredient consumption, and hygiene assessments.\nAssist in food preparation for school functions, meetings, and extracurricular events.\nEngage with suppliers to ensure the quality and freshness of food deliveries.\nEnforce adherence to health and safety regulations in line with Ministry of Health and county public health standards.\nPromptly report any equipment issues and oversee the proper maintenance of kitchen appliances.\nParticipate in scheduled school meetings as necessary and offer insights on kitchen operations.\n\nRequirements:\n- Uphold all requisite qualifications and criteria\n- Maintain the same job scope and duties\n- Utilize varied wording and organization\n- Craft a professional and captivating tone\n- Retain salary, location, and contact details\n- Provide detailed and thorough content\n- Ensure SEO-friendliness and uniqueness for Google indexing",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possess a minimum of 2 years of hands-on experience as a chef or cook in a fast-paced kitchen environment, with a preference for experience in a school or institutional setting\n- Demonstrated proficiency in preparing a diverse array of local and international culinary dishes\n- Familiarity with child nutrition and food allergy considerations is a significant asset\n- Hold a recognized certificate or diploma in Culinary Arts, Food Production, or a related field\n- Stay abreast of current food safety protocols, hygiene practices, and sanitation standards, such as possessing a valid Public Health Certification\n- Exhibit exceptional organizational skills and adept time management abilities\n- Capable of thriving in high-pressure situations and effectively juggling multiple responsibilities",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 10,
      "date": "20 August 2025",
      "job_title": "REGIONAL SALES EXECUTIVES",
      "nature_of_job": "FULL TIME",
      "industry": "LUBRICANTS",
      "salary": "KSHS.75,000",
      "job_location": "NAIROBI, MT. KENYA, RIFT VALLEY, WESTERN & NYANZA",
      "duties_and_responsibilities": "Territory Sales Development\n\nAssess the dynamic landscape of the regional market to pinpoint areas with high sales potential.\nCraft a comprehensive territory strategy outlining specific objectives, customer segments, and revenue forecasts.\nLeverage data and on-the-ground insights to customize tactics in alignment with local market demands.\n\nNew Business Acquisition\n\nIdentify and initiate connections with potential clients utilizing various outreach methods such as cold calling, field visits, digital platforms, and networking events.\nEngage in consultative sales dialogues to grasp customer requirements and present tailored solutions effectively.\nDevelop personalized proposals and successfully secure deals within designated timelines.\n\nKey Account Management\n\nNurture enduring relationships with key clientele through regular touchpoints and service evaluations.\nServe as the primary contact for issue escalations, ensuring customer contentment and loyalty.\nDrive revenue growth by promoting additional products/services to existing client base.\n\nRevenue & Target Achievement\n\nTake ownership of meeting monthly, quarterly, and annual sales objectives.\nSustain a steady sales pipeline and provide precise revenue projections.\nUtilize CRM tools, dashboards, and tracking mechanisms to monitor performance and enhance results.\n\nMarket Intelligence & Competitor Analysis\n\nCollect intelligence on competitors’ offerings, pricing tactics, and market trends.\nOffer insights to marketing and product teams to enhance value propositions.\nIdentify emerging market patterns and communicate potential risks or opportunities.\n\nCollaboration & Cross-functional Partnership\n\nCollaborate closely with internal departments — including marketing, operations, finance, and customer service — to ensure seamless order processing and post-sales support.\nContribute innovative ideas to campaigns, product launches, and region-specific promotional activities.\nEnsure adherence to company policies, credit terms, and operational protocols.\n\nReporting & Documentation\n\nMaintain updated records in CRM and reporting systems, documenting call logs, client interactions, and deal progress.\nSubmit regular activity reports encompassing funnel metrics, win/loss analysis, and travel schedules.\nParticipate in periodic sales reviews to present territory performance and insights.\n\nRegional Brand Representation\n\nAct as the company’s representative at local trade shows, industry gatherings, and client engagements.\nEstablish a prominent brand presence within the region through ethical practices and professional interactions.\nServe as a brand advocate, educating clients and prospects on the company’s value proposition.\n\nRequirements:\n- Fulfill all specified qualifications and requirements\n- Maintain the same job responsibilities and scope\n- Reframe content with distinct wording and structure\n- Craft professional and engaging language\n- Retain existing salary, location, and contact information\n- Ensure comprehensive and detailed content\n- Optimize content for SEO and uniqueness for search engine indexing",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possess a Bachelor's degree in Business Administration, Marketing, or a relevant discipline.\n- Have a successful track record of 3–5 years in driving regional or territory sales within the energy and lubricants industry.\n- Hold a valid driver's license.\n- Demonstrated ability to consistently achieve or surpass sales objectives.\n- Proficient in customer relationship management and adept at negotiation strategies.\n- Excellent verbal and written communication skills, coupled with strong presentation abilities and interpersonal acumen.\n- Self-driven, exceptionally organized, and capable of working autonomously.\n- Skilled in utilizing MS Office Suite and CRM software such as Salesforce, Zoho, or HubSpot.\n- Willingness to undertake frequent travel within the designated region.\n- Open to the possibility of relocating or being stationed in various parts of the country.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 11,
      "date": "20 August 2025",
      "job_title": "REGIONAL SALES EXECUTIVES",
      "nature_of_job": "FULL TIME",
      "industry": "LUBRICANTS",
      "salary": "KSHS.75,000",
      "job_location": "NAIROBI, MT. KENYA, RIFT VALLEY, WESTERN & NYANZA",
      "duties_and_responsibilities": "Territory Sales Expansion\n\nExplore regional market dynamics to pinpoint lucrative sales territories.\nDevelop a comprehensive territory blueprint outlining objectives, customer segments, and revenue forecasts.\nLeverage data and on-ground insights to adjust strategies according to local market demands.\n\nProspective Client Engagement\n\nIdentify and connect with potential clients using a mix of cold outreach, field visits, online engagement, and networking.\nEngage in consultative sales dialogues to grasp client needs and propose tailored solutions.\nCraft personalized proposals and finalize deals within specified timelines.\n\nStrategic Account Management\n\nNurture solid relationships with key clients through routine check-ins and service evaluations.\nServe as the primary contact for issue resolutions, ensuring client contentment and loyalty.\nPromote additional products/services to existing accounts through upselling and cross-selling.\n\nSales Target Attainment\n\nTake charge of meeting monthly, quarterly, and annual sales objectives.\nMaintain a steady sales pipeline and forecast accurate revenue contributions.\nUtilize tools such as CRM systems, dashboards, and trackers to track progress and enhance performance.\n\nMarket Insight & Competitive Examination\n\nCollect intelligence on competitor products, pricing tactics, and market movements.\nOffer insights to marketing and product teams to enhance value propositions.\nIdentify market trends proactively and communicate potential risks or opportunities.\n\nCollaboration & Interdepartmental Coordination\n\nCollaborate closely with internal departments — marketing, operations, finance, and customer service — to ensure seamless order processing and post-sales support.\nContribute innovative ideas to campaigns, product launches, or region-specific promotions.\nEnsure adherence to company policies, credit terms, and operational protocols.\n\nDocumentation & Reporting\n\nMaintain updated records in CRM systems and other reporting platforms, including call logs, client interactions, and lead/deal statuses.\nSubmit routine activity reports encompassing funnel metrics, win/loss analyses, and travel schedules.\nParticipate in monthly or quarterly sales assessments and deliver territory performance presentations.\n\nRegional Brand Representation\n\nRepresent the organization at local industry events, trade shows, and client gatherings.\nEstablish a prominent brand presence in the region through ethical conduct and professional interactions.\nServe as a brand advocate, educating clients and prospects on the company’s value proposition.\n\nRequirements:\n- Fulfill all specific requirements and qualifications\n- Retain the identical job scope and duties\n- Employ varied wording and structure\n- Maintain a professional and captivating tone\n- Preserve the original salary, location, and contact details\n- Ensure detailed and exhaustive content\n- Optimize content for SEO and ensure uniqueness for search engine indexing.",
      "key_requirements_skills_qualification": "Qualifications:\n- Bachelor's degree in Business Administration, Marketing, or a related field of study.\n- A solid track record of 3 to 5 years in successful sales roles within the energy and lubricants industry, focusing on regional or territory markets.\n- Possession of a valid driver's license.\n- Proven ability to consistently achieve or surpass sales targets.\n- Proficient in customer relationship management and skilled in negotiation tactics.\n- Exceptional verbal and written communication, as well as adept at delivering compelling presentations.\n- Highly self-motivated, exceptionally organized, and capable of thriving in an autonomous work environment.\n- Skilled in utilizing MS Office Suite and various CRM platforms like Salesforce, Zoho, and HubSpot.\n- Flexibility and willingness to travel frequently throughout the region.\n- Open to relocation or deployment to any part of the nation as required.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 12,
      "date": "20 August 2025",
      "job_title": "MARKETING EXECUTIVE",
      "nature_of_job": "FULL TIME",
      "industry": "MARKETING",
      "salary": "KSHS. 30,000-40,000",
      "job_location": "RUIRU",
      "duties_and_responsibilities": "Engagement and Lead Handling\n\nServe as the primary contact for customer queries across multiple channels such as calls, SMS, WhatsApp, emails, and social media, particularly those originating from advertising campaigns like radio spots.\nRecord and store essential customer details, including but not limited to names, contact information, inquiry nature, geographical location, and specific preferences.\nManage a structured CRM or lead management system to facilitate efficient follow-ups and conversion tracking.\n\nStrategic Marketing Initiatives\n\nConceptualize, implement, and oversee tailored marketing initiatives to boost visibility of the company’s services, properties, or ongoing ventures.\nCoordinate diverse online (digital) and offline (traditional) marketing tactics, encompassing:\n- Social media promotions (Facebook, Instagram, LinkedIn, etc.)\n- Email campaigns and mass SMS broadcasts\n- Radio and print advertising endeavors\n- Community engagement events and promotional tours\n\nDigital Strategy and Content Development\n\nCreate and schedule engaging content for various social media platforms.\nMonitor audience interaction and promptly address comments or inquiries across digital platforms.\nEvaluate campaign performance metrics and propose enhancements to increase outreach and engagement rates.\n\nSupport for Bids and Business Expansion\n\nAid in compiling tender documentation, including:\n- Corporate background and track record\n- Compliance certifications (e.g., NCA, KRA, Tax)\n- Previous project achievements and references\n- Other mandatory technical and legal paperwork\nCollaborate closely with technical teams to meet submission deadlines effectively.\n\nMarket Analysis and Performance Reporting\n\nConduct competitive assessments and gather market insights to inform marketing strategies.\nGenerate weekly and monthly reports on lead generation efficacy, campaign performance, and customer input.\nSuggest modifications to campaigns based on data analysis findings.\n\nQualifications:\n- Fulfill all specific requirements and qualifications\n- Retain the same job responsibilities and scope\n- Utilize varied wording and format\n- Craft an engaging and professional tone\n- Maintain current salary, location, and contact details\n- Ensure comprehensive and detailed content\n- Make the text SEO-friendly and distinct for optimal search engine visibility",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possession of a Bachelor's degree or a relevant Diploma in Marketing, Business Administration, Communication, or a related discipline\n- Minimum of 2 years of proven experience in a marketing or customer-facing position; familiarity with the construction or real estate industry is a plus\n- Proficiency in utilizing digital marketing tools and Customer Relationship Management (CRM) systems\n- Exceptional organizational abilities, effective communication skills, and strong interpersonal aptitude\n- Demonstrated capacity to manage multiple tasks, adhere to deadlines, and thrive in an independent work environment\n- Meticulous attention to detail and a commitment to delivering accurate results",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 13,
      "date": "20 August 2025",
      "job_title": "MARKETING EXECUTIVE",
      "nature_of_job": "FULL TIME",
      "industry": "MARKETING",
      "salary": "KSHS. 30,000-40,000",
      "job_location": "RUIRU",
      "duties_and_responsibilities": "Engagement with Customers and Lead Nurturing\n\nServe as the primary point of contact for customer inquiries across various communication channels such as phone calls, SMS, WhatsApp, emails, and social media platforms, particularly those originating from promotional campaigns like radio ads.\nCollect and record essential customer details, including names, contact information, nature of inquiry, customer location, and specific preferences.\nManage a systematic CRM or lead management system to facilitate seamless follow-ups and enhance conversion rates.\n\nStrategic Marketing Initiatives and Promotional Activities\n\nConceptualize, implement, and supervise tailored marketing initiatives aimed at boosting awareness of the company's services, properties, or ongoing ventures.\nCoordinate a blend of online (digital) and offline (traditional) marketing tactics, encompassing:\n- Social media promotion (e.g., Facebook, Instagram, LinkedIn)\n- Email marketing and mass SMS campaigns\n- Advertising through radio and print media\n- Participation in community events and roadshows\n\nCreation of Digital Content and Management\n\nCraft and schedule engaging content for various social media platforms.\nMonitor user engagement and promptly address comments or inquiries on digital platforms.\nEvaluate the performance of marketing campaigns and recommend enhancements to drive broader reach and increased engagement.\n\nSupport for Tender Processes and Business Growth\n\nAid in compiling tender documentation, including:\n- Company overview and historical background\n- Compliance certifications (e.g., NCA, KRA, Tax)\n- Past project accomplishments and client references\n- Relevant statutory and technical paperwork\nCollaborate closely with technical teams to meet submission deadlines effectively.\n\nMarket Analysis and Reporting\n\nConduct competitor assessments and gather market insights to steer marketing strategies in the right direction.\nGenerate regular reports on lead generation, campaign efficacy, and customer feedback, both weekly and monthly.\nPropose adjustments to marketing campaigns based on data-driven insights.\n\nRequirements:\n- Uphold specific qualifications and requirements as stated\n- Retain the same job responsibilities and scope\n- Ensure a professional and engaging tone\n- Refrain from altering salary, location, or contact details\n- Maintain a detailed and comprehensive approach\n- Craft SEO-friendly and distinctive content for optimal search engine visibility",
      "key_requirements_skills_qualification": "Essential Qualifications and Skills:\n- Possess a Degree or Diploma in Marketing, Business Administration, Communication, or a relevant discipline\n- Minimum of 2 years of hands-on experience in a marketing or customer-centric role, with a preference for exposure to the construction or real estate industry\n- Proficiency in utilizing digital marketing tools and Customer Relationship Management (CRM) systems\n- Demonstrated proficiency in organizational prowess, effective communication, and adept interpersonal abilities\n- Proven capability to handle multiple tasks concurrently, adhere to deadlines, and excel in independent work settings\n- Exceptional attention to detail and a commitment to ensuring precision and accuracy in all endeavors",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 14,
      "date": "20 August 2025",
      "job_title": "RECEPTIONIST",
      "nature_of_job": "FULL TIME",
      "industry": "EDUCATION",
      "salary": "KSHS. 20,000-25,000",
      "job_location": "BURUBURU",
      "duties_and_responsibilities": "Front Desk Operations\n\n1. Extend a warm and professional welcome to visitors, parents, and students upon their arrival at the front desk.\n2. Guide guests to the appropriate areas and ensure adherence to school security procedures for sign-in and sign-out processes.\n3. Handle incoming phone calls with courtesy and efficiency, directing calls as necessary.\n4. Provide timely responses to inquiries received through phone calls, emails, or in-person interactions.\n\nAdministrative Assistance\n\n1. Update and manage student and visitor records accurately and as needed.\n2. Support the coordination of school schedules and appointments for staff members.\n3. Aid the administrative team with tasks such as filing, photocopying, printing, and data entry.\n4. Manage mail distribution and oversee school supplies and parcel deliveries.\n\nEffective Communication and Coordination\n\n1. Facilitate communication between parents and teachers when required.\n2. Prepare routine correspondence and circulars based on instructions from school leadership.\n3. Assist in the planning and execution of school events, parent-teacher meetings, and open houses.\n\nOffice Administration\n\n1. Monitor office supplies inventory, placing orders for replenishment as required.\n2. Ensure the front office area is consistently tidy, organized, and inviting.\n3. Uphold strict confidentiality standards when managing sensitive information.\n\nRequirements:\n- Fulfill all specified qualifications and requirements.\n- Maintain the same job responsibilities and scope.\n- Utilize distinct phrasing and structure for enhanced engagement.\n- Retain the job location, salary details, and contact information.\n- Enhance detail and comprehensiveness.\n- Craft SEO-friendly content to improve search engine visibility.",
      "key_requirements_skills_qualification": "Qualifications:\n- Possess a Diploma in Front Office Operations, Business Administration, or a related discipline\n- Demonstrated experience of at least 2 years in roles such as front office, receptionist, or customer service\n- Proficiency in utilizing the Microsoft Office Suite, including Word, Excel, and Outlook\n- Exceptional verbal and written communication abilities in both English and Kiswahili\n- Display outstanding interpersonal skills coupled with a friendly and welcoming demeanor\n- Capable of handling multiple tasks, maintaining organization, and thriving under pressure within a dynamic school setting\n- Familiarity with educational environments or experience working with children is a valued asset\n\nRequirements:\n- Hold a diploma in Front Office Operations, Business Administration, or a related field\n- Minimum of 2 years’ experience in front office, receptionist, or customer service positions\n- Proficient in Microsoft Office Suite applications (Word, Excel, Outlook)\n- Strong verbal and written communication skills in English and Kiswahili\n- Exceptional interpersonal skills and a welcoming attitude\n- Ability to manage multiple tasks, maintain organization, and perform effectively under pressure in a busy school environment\n- Previous exposure to school settings or working with children is a beneficial advantage",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 15,
      "date": "20 August 2025",
      "job_title": "CHEF",
      "nature_of_job": "FULL TIME",
      "industry": "EDUCATION",
      "salary": "KSHS. 20,000-25,000",
      "job_location": "BURUBURU",
      "duties_and_responsibilities": "Job Duties and Responsibilities:\nCraft and prepare daily meals (including breakfast, lunch, and snacks) in accordance with the school menu and individual student dietary needs.\nEnsure that meals are nutritionally balanced, tailored to different age groups, and visually enticing to young learners.\nUphold stringent hygiene and cleanliness standards across all food preparation and serving zones.\nProvide leadership by supervising and coaching kitchen assistants to optimize operational efficiency and foster their professional growth.\nOversee kitchen inventory, monitor consumption patterns, and sustain optimal stock levels.\nEfficiently procure ingredients and supplies, focusing on timely delivery and cost efficiency.\nImplement strategies to reduce food wastage and enhance resource conservation.\nCollaborate with school management to design weekly and monthly menus that adhere to nutritional guidelines and meet student preferences.\nAccommodate students with food allergies and special dietary needs without compromising on taste or quality.\nCoordinate meal schedules to ensure prompt service during school breaks and lunch periods.\nMaintain meticulous records of daily meal tallies, ingredient usage, and sanitation assessments.\nAssist in food preparation for school functions, meetings, and extracurricular events.\nEngage with suppliers to verify the quality and freshness of food deliveries.\nEnforce compliance with health and safety protocols as stipulated by the Ministry of Health and local public health authorities.\nPromptly report any equipment issues and oversee the upkeep of kitchen appliances.\nParticipate in scheduled school meetings and offer insights on kitchen operations for continuous improvement.\n\nRequirements:\n- Fulfill all specified qualifications and prerequisites\n- Retain the same job scope and duties\n- Employ diverse vocabulary and structure\n- Convey professionalism and captivation\n- Maintain existing salary, location, and contact details\n- Elaborate on details and comprehensiveness\n- Optimize content for SEO and uniqueness for search engine indexing",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possess a minimum of 2 years of hands-on experience as a chef or cook in a fast-paced culinary environment (prior work in a school or institutional setting is a definite plus)\n- Demonstrated proficiency in preparing a diverse array of local and international dishes\n- Familiarity with child nutrition guidelines and food allergy management is highly valued\n- Hold a recognized certificate or diploma in Culinary Arts, Food Production, or a related discipline\n- Stay current with food safety protocols, hygiene practices, and sanitation standards (e.g., possess an active Public Health Certification)\n- Exhibit strong organizational capabilities and effective time management skills\n- Capable of thriving under pressure while efficiently handling multiple responsibilities",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 16,
      "date": "20 August 2025",
      "job_title": "REGIONAL SALES EXECUTIVES",
      "nature_of_job": "FULL TIME",
      "industry": "LUBRICANTS",
      "salary": "KSHS.75,000",
      "job_location": "NAIROBI, MT. KENYA, RIFT VALLEY, WESTERN & NYANZA",
      "duties_and_responsibilities": "Regional Sales Expansion\n\nSurvey local market dynamics to pinpoint lucrative sales territories ripe for development.\nCraft a comprehensive regional strategy delineating objectives, target customer segments, and revenue forecasts.\nLeverage data analytics and field insights to tailor tactics to meet distinct regional demands.\n\nProspective Client Engagement\n\nIdentify and initiate contact with potential clientele via diverse methods including cold outreach, in-person visits, online networking, and digital outreach.\nEngage in consultative sales dialogues to grasp client requirements and propose tailored solutions.\nDevelop bespoke proposals and secure agreements within specified timelines.\n\nStrategic Account Management\n\nNurture enduring relationships with key accounts through routine touchpoints and service evaluations.\nServe as the primary escalation point, ensuring client contentment and loyalty.\nDrive additional sales by promoting complementary offerings to existing clients.\n\nRevenue Attainment & Goal Fulfillment\n\nShoulder the responsibility for achieving monthly, quarterly, and annual sales objectives.\nSustain a steady sales pipeline and forecast precise revenue contributions.\nUtilize CRM systems, dashboards, and monitoring tools to track progress and enhance performance.\n\nMarket Insight & Competitive Analysis\n\nCollect intelligence on rival products, pricing tactics, and industry movements.\nFurnish actionable feedback to marketing and product teams to optimize value propositions.\nDetect emerging market trends in advance and communicate potential risks or opportunities.\n\nCollaboration & Interdepartmental Coordination\n\nCollaborate closely with internal departments such as marketing, operations, finance, and customer service to ensure seamless order processing and post-sales support.\nContribute innovative concepts to promotional campaigns, product launches, and region-specific marketing initiatives.\nEnsure adherence to organizational policies, credit terms, and operational protocols.\n\nDocumentation & Reporting\n\nMaintain updated records in CRM platforms and other reporting systems detailing call logs, client interactions, and lead/deal status.\nFurnish routine activity reports encompassing sales funnel metrics, win/loss analysis, and travel schedules.\nParticipate in periodic sales evaluations to present regional performance insights.\n\nRegional Brand Representation\n\nServe as the face of the company at local trade exhibitions, industry gatherings, and client rendezvous.\nCultivate a robust brand presence in the region through ethical practices and professional interactions.\nFunction as a brand advocate, educating clients and prospects on the company's unique value propositions.\n\nRequirements:\n- Fulfill all specified qualifications and prerequisites\n- Retain the identical job responsibilities and duties\n- Alter the phrasing and structure\n- Maintain a professional and captivating tone\n- Preserve the salary, location, and contact details\n- Ensure detailed and exhaustive content\n- Optimize the content for SEO and ensure uniqueness for search engine indexing",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Bachelor's degree in Business Administration, Marketing, or a related field.\n- A minimum of 3 to 5 years of successful experience in sales within the energy and lubricants industry at a regional or territory level.\n- Possession of a valid driver's license.\n- Proven track record of achieving and surpassing sales objectives.\n- Proficient in customer relationship management and adept at negotiation strategies.\n- Exceptional verbal and written communication skills with a talent for presentations and building interpersonal relationships.\n- Self-driven, meticulously organized, and capable of working autonomously.\n- Advanced proficiency in utilizing MS Office Suite and CRM platforms like Salesforce, Zoho, or HubSpot.\n- Willingness to travel frequently throughout the designated region.\n- Open to relocation or assignment to various locations nationwide.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 17,
      "date": "20 August 2025",
      "job_title": "REGIONAL SALES EXECUTIVES",
      "nature_of_job": "FULL TIME",
      "industry": "LUBRICANTS",
      "salary": "KSHS.75,000",
      "job_location": "NAIROBI, MT. KENYA, RIFT VALLEY, WESTERN & NYANZA",
      "duties_and_responsibilities": "Territory Sales Development\n\nAssess the dynamic regional market landscape to pinpoint lucrative sales territories.\nCraft a comprehensive territory blueprint outlining precise objectives, customer demographics, and revenue forecasts.\nLeverage data and on-the-ground insights to fine-tune strategies according to the unique needs of each local market.\n\nNew Business Development\n\nIdentify and engage potential clients through a strategic mix of cold calls, field visits, digital outreach, and networking events.\nEngage in consultative sales dialogues to grasp customer requirements and propose tailored solutions.\nCreate personalized proposals and secure deals within set timelines.\n\nKey Client Management\n\nFoster enduring relationships with key accounts through regular touchpoints and service evaluations.\nServe as a primary contact for issue resolution, ensuring maximum customer satisfaction and retention.\nImplement upselling and cross-selling strategies to expand offerings to existing clientele.\n\nSales Targets & Revenue Attainment\n\nTake ownership of achieving monthly, quarterly, and annual sales objectives.\nManage a consistent sales pipeline and forecast precise revenue contributions.\nUtilize CRM systems, dashboards, and monitoring tools to track progress and enhance sales performance.\n\nMarket Insight & Competitive Analysis\n\nCollect intelligence on competitor products, pricing tactics, and market movements.\nOffer insights to marketing and product teams for refining value propositions.\nIdentify emerging market trends proactively and communicate potential risks or opportunities.\n\nCollaboration & Interdepartmental Coordination\n\nCollaborate closely with internal departments such as marketing, operations, finance, and customer service to streamline order processing and post-sales service.\nContribute innovative ideas for campaigns, product launches, and region-specific promotional activities.\nEnsure adherence to company guidelines, credit terms, and operational protocols.\n\nReporting & Documentation\n\nMaintain updated CRM databases and reporting platforms with call records, client engagements, and lead/deal statuses.\nSubmit regular activity reports encompassing funnel metrics, win/loss analyses, and travel schedules.\nParticipate in monthly or quarterly sales evaluations and present territory performance metrics.\n\nRegional Brand Representation\n\nRepresent the organization at local trade exhibitions, industry gatherings, and client consultations.\nEstablish a robust brand presence within the region through ethical practices and professional interactions.\nServe as a brand advocate, educating clients and prospects on the company's unique value offerings.\n\nRequirements:\n- Fulfill all specified qualifications and requirements\n- Retain the same job responsibilities and scope\n- Employ varied wording and structure\n- Maintain a professional and compelling tone\n- Preserve salary, location, and contact details\n- Ensure thoroughness and detail\n- Enhance SEO-friendliness and uniqueness for search engine indexing.",
      "key_requirements_skills_qualification": "Qualifications:\n- Bachelor's degree in Business Administration, Marketing, or a relevant discipline.\n- Demonstrated success with 3 to 5 years of experience in driving regional or territory sales within the energy and lubricants industry.\n- Possession of a current and valid driver's license.\n- Proven ability to consistently achieve or surpass sales objectives.\n- Comprehensive knowledge of customer relationship management and adept negotiation skills.\n- Exceptional verbal and written communication, adept presentation, and strong interpersonal capabilities.\n- Intrinsic self-motivation, exceptional organizational prowess, and the capacity to work autonomously.\n- Proficiency in utilizing MS Office Suite and CRM platforms such as Salesforce, Zoho, and HubSpot.\n- Readiness to undertake frequent travel within the designated region.\n- Openness to potential relocation or assignment to any part of the country.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 18,
      "date": "20 August 2025",
      "job_title": "REGIONAL SALES EXECUTIVES",
      "nature_of_job": "FULL TIME",
      "industry": "LUBRICANTS",
      "salary": "KSHS.75,000",
      "job_location": "NAIROBI, MT. KENYA, RIFT VALLEY, WESTERN & NYANZA",
      "duties_and_responsibilities": "Territory Sales Development\n\nAssess the dynamic landscape of the regional market to pinpoint lucrative sales territories.\nCraft a comprehensive territory strategy outlining objectives, customer demographics, and revenue forecasts.\nUtilize data analytics and on-the-ground insights to tailor approaches to meet local market demands.\n\nNew Business Procurement\n\nIdentify and connect with potential clientele via cold calls, field visits, digital platforms, and networking events.\nEngage in consultative sales dialogues to grasp customer requirements and offer tailored solutions.\nDevelop personalized proposals and secure agreements within specified timelines.\n\nStrategic Account Management\n\nNurture enduring relationships with key accounts through regular interactions and service evaluations.\nServe as the primary contact for issue resolutions, ensuring client contentment and loyalty.\nDrive revenue growth by promoting supplementary products/services to existing clientele.\n\nSales Target Attainment\n\nTake ownership of achieving monthly, quarterly, and yearly sales goals.\nSustain a consistent sales pipeline and provide precise revenue forecasts.\nLeverage CRM tools, dashboards, and trackers to monitor progress and enhance performance.\n\nMarket Insight & Competitive Analysis\n\nCollect intelligence on competitor offerings, pricing strategies, and market trends.\nOffer insights to the marketing and product teams to enhance value propositions.\nIdentify emerging market trends and communicate potential risks or opportunities.\n\nCollaboration & Interdepartmental Coordination\n\nCollaborate closely with internal departments such as marketing, operations, finance, and customer service to ensure seamless order processing and post-sales support.\nContribute innovative concepts to campaigns, product launches, and region-specific marketing initiatives.\nAdhere to company policies, credit terms, and operational protocols.\n\nReporting & Documentation\n\nMaintain CRM databases and other reporting platforms with call records, client engagements, and lead/deal statuses.\nDeliver routine activity summaries encompassing funnel metrics, win/loss assessments, and travel schedules.\nParticipate in periodic sales evaluations and present territory performance updates.\n\nRegional Brand Advocacy\n\nRepresent the organization at local trade shows, industry gatherings, and client consultations.\nEstablish a robust brand presence within the region through ethical practices and professional interactions.\nServe as a brand envoy, educating clients and prospects on the company’s value proposition.\n\nRequirements:\n- Fulfill all specified prerequisites and qualifications\n- Retain identical job expectations and accountabilities\n- Employ varied vocabulary and structure\n- Maintain a professional and captivating tone\n- Retain existing salary, location, and contact details\n- Ensure thoroughness and detail\n- Optimize content for SEO and ensure uniqueness for improved search engine indexing",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Bachelor's degree in Business Administration, Marketing, or a related discipline.\n- A successful track record of 3 to 5 years in driving regional or territory sales within the energy and lubricants industry.\n- Possession of a current and valid driver's license.\n- Proven ability to consistently achieve or surpass sales objectives.\n- Proficient in customer relationship management and skilled in effective negotiation tactics.\n- Exceptional verbal and written communication skills, adept at presentations, and strong interpersonal abilities.\n- Self-driven, impeccably organized, and capable of working autonomously.\n- Proficiency in utilizing MS Office Suite and CRM platforms like Salesforce, Zoho, or HubSpot.\n- Willingness to travel extensively within the designated region.\n- Openness to potential relocation or assignment to various locations nationwide.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 19,
      "date": "20 August 2025",
      "job_title": "MARKETING EXECUTIVE",
      "nature_of_job": "FULL TIME",
      "industry": "MARKETING",
      "salary": "KSHS. 30,000-40,000",
      "job_location": "RUIRU",
      "duties_and_responsibilities": "Engagement and Customer Lead Management\n\nServe as the initial contact point for all customer queries across various channels such as calls, SMS, WhatsApp, emails, and social media platforms, particularly those originating from advertising efforts like radio campaigns.\nRecord and store essential customer details, including full names, contact information, nature of inquiries, customer location data, and specific preferences.\nManage a structured CRM system or lead-tracking platform to facilitate efficient follow-ups and enhance conversion rates.\n\nStrategic Marketing Initiatives and Promotions\n\nConceptualize, implement, and oversee tailored marketing initiatives aimed at boosting the visibility of the company's offerings, properties, or ongoing ventures.\nCoordinate a blend of online (digital) and offline (traditional) marketing tactics, encompassing activities like:\n- Social media promotions (Facebook, Instagram, LinkedIn, etc.)\n- Email marketing campaigns and bulk SMS initiatives\n- Radio spots and print advertisements\n- Community engagement events and roadshow programs\n\nDigital Marketing Strategies and Content Development\n\nCreate and schedule engaging content for various social media channels.\nMonitor audience interactions and promptly respond to comments or inquiries on digital platforms.\nEvaluate the performance of marketing campaigns, identifying areas for enhancement to amplify reach and engagement levels.\n\nSupport for Tender Processes and Business Growth\n\nAid in compiling tender documentation, including:\n- Company background and historical information\n- Compliance certifications (NCA, KRA, Tax, etc.)\n- Previous project outcomes and client references\n- Other essential statutory and technical records\nCollaborate closely with technical teams to meet submission deadlines effectively.\n\nMarket Analysis and Performance Evaluation\n\nConduct in-depth competitor assessments and gather market insights to inform strategic marketing decisions.\nGenerate regular reports on lead generation metrics, campaign efficiency, and customer input on a weekly and monthly basis.\nPropose adjustments to marketing strategies based on data-driven insights to drive better outcomes.\n\nRequirements:\n- Adhere to all specified prerequisites and qualifications\n- Maintain the identical job responsibilities and scope\n- Implement varied wording and structure for a fresh perspective\n- Ensure a professional and captivating tone\n- Retain the original salary, location, and contact details\n- Offer detailed and comprehensive information\n- Craft SEO-friendly and distinctive content for optimal search engine visibility.",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possession of a Degree or Diploma in Marketing, Business Administration, Communication, or a relevant discipline\n- Demonstrated track record of at least 2 years in a marketing or customer-centric capacity, with a preference for experience within the construction or real estate industry\n- Proficiency in utilizing digital marketing solutions and managing CRM platforms\n- Exceptional organizational, communication, and interpersonal proficiencies\n- Proven ability to juggle multiple tasks, adhere to deadlines, and excel with minimal supervision\n- Meticulous attention to detail and commitment to precision",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 20,
      "date": "20 August 2025",
      "job_title": "MARKETING EXECUTIVE",
      "nature_of_job": "FULL TIME",
      "industry": "MARKETING",
      "salary": "KSHS. 30,000-40,000",
      "job_location": "RUIRU",
      "duties_and_responsibilities": "Engagement with Customers and Lead Handling\n\nServe as the initial touchpoint for customer inquiries across various communication channels such as phone calls, SMS, WhatsApp, emails, and social media, particularly those originating from advertising initiatives like radio campaigns.\nCollect and record essential customer details, including full names, contact information, nature of inquiry, customer location, and specific preferences.\nManage a structured CRM system or lead tracker to facilitate efficient follow-ups and conversions.\n\nCampaign Management and Promotions\n\nDevise, implement, and oversee tailored marketing campaigns aimed at showcasing the company's services, properties, or ongoing ventures.\nCoordinate diverse online (digital) and offline (traditional) marketing tactics, encompassing:\nSocial media engagement (Facebook, Instagram, LinkedIn, etc.)\nEmail promotions and mass SMS\nRadio and print advertising\nCommunity events and promotional activities\n\nOnline Marketing and Content Development\n\nCreate and schedule content for various social media platforms.\nTrack engagement levels and address comments or inquiries on digital platforms promptly.\nEvaluate campaign performance metrics and propose enhancements for increased outreach and engagement.\n\nSupport for Bids and Business Expansion\n\nAid in compiling tender documents, including:\nCorporate profile and background information\nCompliance certifications (e.g., NCA, KRA, Tax obligations)\nPast project track record and references\nOther necessary statutory and technical paperwork\nCollaborate closely with technical teams to meet submission deadlines effectively.\n\nMarket Analysis and Reporting\n\nConduct competitor evaluations and gather market insights to inform marketing strategies.\nGenerate weekly and monthly reports on lead generation, campaign efficacy, and customer input.\nRecommend modifications to campaigns based on analytical insights.\n\nQualifications:\n- Adhere to all specified requirements and qualifications\n- Retain the identical job scope and duties\n- Utilize diverse phrasing and structure\n- Maintain a professional and engaging tone\n- Retain original salary, location, and contact details\n- Ensure detailed and comprehensive content\n- Craft SEO-friendly and unique content for optimal search engine visibility",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possess a Degree or Diploma in Marketing, Business Administration, Communication, or a closely related field\n- Minimum of 2 years of hands-on experience in a marketing or customer-facing role; previous involvement in the construction or real estate industry is a valued asset\n- Proficiency in utilizing digital marketing platforms and Customer Relationship Management (CRM) systems\n- Demonstrated excellence in organizational prowess, communication proficiency, and adept interpersonal skills\n- Capable of managing multiple tasks simultaneously, meeting strict deadlines, and thriving in an environment with limited supervision\n- Exemplary attention to detail and unwavering commitment to precision",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 21,
      "date": "20 August 2025",
      "job_title": "ACCOUNTANT",
      "nature_of_job": "PART-TIME",
      "industry": "SALARY",
      "salary": "KSHS. 15,000",
      "job_location": "NAIROBI",
      "duties_and_responsibilities": "Job Duties and Responsibilities:\n\n1. Precisely maintain financial records, encompassing ledgers, journals, and reconciliations.\n2. Compile monthly financial reports, comprising profit and loss statements, balance sheets, and cash flow statements.\n3. Ensure adherence to statutory obligations like PAYE, VAT, SHIF, NSSF, and timely iTax submissions.\n4. Manage accounts payable and receivable, oversee invoicing, and pursue outstanding payments.\n5. Supervise company budgets, aiding in forecasting activities.\n6. Conduct bank reconciliations and oversee petty cash management.\n7. Utilize accounting software and Microsoft Excel for data input, reporting, and analysis.\n8. Facilitate audits by furnishing necessary documentation and information.\n9. Offer guidance to management on cost containment, financial planning, and policy formulation.\n\nRequirements:\n- Uphold specific qualifications and requirements.\n- Retain the same job responsibilities and scope.\n- Present the content professionally and engagingly.\n- Modify the wording and structure while retaining accuracy.\n- Ensure the content is SEO-friendly and original for Google indexing.\n- Maintain detailed and comprehensive information without altering salary, location, or contact details.",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possession of a Bachelor's degree or equivalent qualification in Accounting, Finance, or a closely related field\n- Preferred possession of a CPA certification\n- Proven track record of at least 2 years in a dynamic accounting setting\n- Proficiency in utilizing various accounting software such as QuickBooks, Sage, or similar platforms\n- Demonstrated expertise in Advanced MS Excel features including VLOOKUP, Pivot Tables, and complex formulas\n- In-depth knowledge of tax regulations and statutory compliance procedures in Kenya\n\nThese qualifications and requirements are essential for the successful candidate to excel in the role and contribute effectively to the organization's financial operations.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 22,
      "date": "20 August 2025",
      "job_title": "ACCOUNTANT",
      "nature_of_job": "PART-TIME",
      "industry": "SALARY",
      "salary": "KSHS. 15,000",
      "job_location": "NAIROBI",
      "duties_and_responsibilities": "Job Duties and Responsibilities:\n\n- Accurately maintain financial records by updating ledgers, journals, and conducting reconciliations regularly.\n- Compile monthly financial reports, including profit and loss statements, balance sheets, and cash flow statements for management review.\n- Ensure adherence to statutory regulations such as PAYE, VAT, SHIF, NSSF, and meet deadlines for filing with iTax.\n- Oversee accounts payable and receivable functions, handle invoice management, and follow up on outstanding payments.\n- Monitor and control company budgets, providing support in forecasting activities.\n- Conduct bank reconciliations and manage petty cash transactions efficiently.\n- Utilize accounting software and Microsoft Excel for data input, reporting, and analytical purposes.\n- Assist in audits by furnishing necessary documentation and information as required.\n- Offer recommendations to senior management on cost management, financial planning, and policy enhancement.\n\nRequirements:\n- Proficiency in maintaining financial records and reports.\n- Knowledge of statutory compliance requirements including PAYE, VAT, SHIF, NSSF, and iTax filing.\n- Experience in accounts payable and receivable functions.\n- Strong budget monitoring and forecasting skills.\n- Proficient in accounting software and Microsoft Excel.\n- Ability to support audit processes effectively.\n- Excellent communication skills for providing financial advice to management.",
      "key_requirements_skills_qualification": "Qualifications:\n- Possess a Degree or Diploma in Accounting, Finance, or a closely related discipline\n- A CPA certification is highly desirable\n- Must have a minimum of 2 years' proven experience in a dynamic accounting setting\n- Proficiency in accounting software such as QuickBooks, Sage, or similar platforms is essential\n- Demonstrated expertise in utilizing advanced MS Excel functions including VLOOKUP, Pivot Tables, and formulas\n- Thorough knowledge of regulatory compliance procedures and Kenyan tax laws\n\nJoin our team if you hold a degree or diploma in Accounting, Finance, or a related field. A CPA certification will give you a competitive edge. We require a minimum of 2 years' experience in a fast-paced accounting environment. Proficiency in accounting software like QuickBooks, Sage, or equivalent is a must. Advanced skills in MS Excel, including VLOOKUP, Pivot Tables, and formulas, are essential. Understanding Kenyan tax laws and statutory compliance processes is crucial for this role.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 23,
      "date": "20 August 2025",
      "job_title": "RECEPTIONIST",
      "nature_of_job": "FULL TIME",
      "industry": "EDUCATION",
      "salary": "KSHS. 20,000-25,000",
      "job_location": "BURUBURU",
      "duties_and_responsibilities": "Front Desk Operations\n\nWarmly welcome and professionally greet all visitors, parents, and students upon their arrival to the school premises.\nEffectively direct guests to the appropriate areas and ensure adherence to school security procedures for signing in and out.\nHandle incoming phone calls with courtesy and efficiency, screening and forwarding them as necessary.\nProvide prompt responses to inquiries received via phone, email, or in-person interactions.\n\nAdministrative Assistance\n\nUpdate and maintain student and visitor records in compliance with established protocols.\nAssist in managing school calendars and scheduling appointments for school personnel.\nSupport the administrative team with tasks such as filing, photocopying, printing, and data input.\nManage mail distribution and coordinate the receipt and dispatch of school supplies and packages.\n\nCommunication Coordination\n\nFacilitate communication between parents and teachers when required.\nCompose basic correspondences and circulars under the guidance of school administration.\nParticipate in the planning and execution of school events, parent-teacher meetings, and open house sessions.\n\nOffice Operations\n\nMonitor inventory levels and place orders for office and stationery supplies as needed.\nEnsure the front office area is consistently tidy, well-organized, and inviting.\nMaintain strict confidentiality regarding sensitive information at all times.\n\nQualifications:\n- Uphold specific requirements and qualifications\n- Retain the same job responsibilities and duties\n- Employ varied wording and arrangement\n- Craft compelling and professional content\n- Retain salary, location, and contact details\n- Provide detailed and thorough information\n- Optimize content for SEO and ensure uniqueness for search engine indexing",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possess a diploma in Front Office Operations, Business Administration, or a relevant field of study\n- Demonstrated experience of at least 2 years in roles such as front office, receptionist, or customer service\n- Proficiency in utilizing Microsoft Office Suite applications including Word, Excel, and Outlook\n- Exceptional verbal and written communication abilities in both English and Kiswahili\n- Strong interpersonal skills coupled with a friendly and approachable demeanor\n- Capable of handling multiple tasks simultaneously, maintaining organization, and performing effectively under pressure within a dynamic school setting\n- Preference given to candidates with familiarity in school environments or experience working with children.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 24,
      "date": "20 August 2025",
      "job_title": "CHEF",
      "nature_of_job": "FULL TIME",
      "industry": "EDUCATION",
      "salary": "KSHS. 20,000-25,000",
      "job_location": "BURUBURU",
      "duties_and_responsibilities": "Crafting and preparing daily meals (including breakfast, lunch, and snacks) in adherence to the school menu and individual dietary needs of students.\nEnsuring that meals are well-balanced, suitable for various age groups, and visually appealing to children.\nUpholding impeccable standards of hygiene and sanitation across all food preparation and serving spaces.\nSupervising and mentoring kitchen support staff to optimize operational efficiency and foster their professional growth.\nManaging kitchen inventory, overseeing consumption patterns, and regulating stock levels effectively.\nPlacing orders for ingredients and provisions promptly and economically.\nMonitoring and implementing strategies to minimize food wastage.\nCollaborating with school management to design and revise weekly and monthly menus that align with nutritional guidelines.\nAccommodating students with specific dietary restrictions and allergies.\nOrganizing meal schedules to guarantee punctual service during school breaks and lunch periods.\nMaintaining meticulous records of daily meal tallies, ingredient utilization, and sanitation assessments.\nAssisting in food preparation for school functions, meetings, and extracurricular events.\nEngaging with suppliers to assure the quality and freshness of delivered food items.\nAdhering to health and safety regulations as outlined by the Ministry of Health and local public health authorities.\nPromptly reporting any kitchen equipment issues and overseeing their upkeep.\nAttending regular school gatherings as necessary and providing insights on kitchen operations.\n\nRequirements:\n- Fulfill all specified qualifications and prerequisites\n- Retain the same job responsibilities and duties\n- Employ varied language and organization\n- Infuse professionalism and engagement\n- Maintain existing salary, location, and contact details\n- Ensure thoroughness and detail\n- Optimize content for SEO and uniqueness for search engine indexing",
      "key_requirements_skills_qualification": "Key Requirements:\n- A minimum of 2 years of hands-on experience as a chef or cook in a fast-paced culinary environment, with a preference for experience in a school or institutional setting\n- Demonstrated proficiency in crafting a diverse array of local and international dishes\n- Familiarity with child nutrition principles and food allergy management is a distinct advantage\n- Possession of a recognized certificate or diploma in Culinary Arts, Food Production, or a related discipline\n- Current knowledge of food safety protocols, hygiene practices, and sanitation guidelines, including holding a valid Public Health Certification\n- Excellent organizational abilities and adept time management skills\n- Ability to thrive in high-pressure situations and effectively juggle multiple responsibilities",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 25,
      "date": "20 August 2025",
      "job_title": "REGIONAL SALES EXECUTIVES",
      "nature_of_job": "FULL TIME",
      "industry": "LUBRICANTS",
      "salary": "KSHS.75,000",
      "job_location": "NAIROBI, MT. KENYA, RIFT VALLEY, WESTERN & NYANZA",
      "duties_and_responsibilities": "Sales Territory Development Specialist\n\nRegional Market Assessment\n\nConduct in-depth analysis of regional market dynamics to pinpoint lucrative sales territories.\nCraft a comprehensive territory blueprint outlining strategic objectives, customer segments, and revenue forecasts.\nLeverage data insights and on-the-ground intelligence to fine-tune approaches in alignment with local market demands.\n\nProspective Client Engagement\n\nIdentify and cultivate relationships with potential clients using a mix of cold calling, field visits, digital outreach, and networking initiatives.\nEngage in consultative sales dialogues to grasp client needs and propose tailored solutions effectively.\nTailor proposals to individual client requirements and successfully secure deals within specified timelines.\n\nKey Client Relationship Management\n\nNurture enduring partnerships with key accounts through regular touchpoints and service evaluations.\nServe as a primary escalation contact to ensure customer contentment and loyalty.\nDrive upselling and cross-selling opportunities to expand offerings within existing client portfolios.\n\nSales Target Attainment\n\nTake ownership of achieving monthly, quarterly, and annual sales objectives.\nSustain a steady sales pipeline and deliver precise revenue forecasts.\nHarness tools like CRM platforms, dashboards, and trackers to track progress and enhance sales performance.\n\nMarket Insight & Competitive Analysis\n\nGather intelligence on competitor products, pricing strategies, and market trends.\nOffer feedback to marketing and product teams to refine value propositions.\nSpot emerging market trends early on and flag potential risks or growth opportunities.\n\nCollaboration & Interdepartmental Coordination\n\nForge strong partnerships with internal teams — including marketing, operations, finance, and customer service — to ensure seamless order processing and post-sales support.\nContribute innovative concepts to marketing campaigns, product launches, and region-specific promotional activities.\nEnsure adherence to company protocols, credit terms, and operational protocols.\n\nReporting & Documentation Management\n\nMaintain up-to-date records on CRM systems and reporting databases with call logs, client interactions, and lead/deal statuses.\nIssue routine activity reports encompassing funnel metrics, win/loss analyses, and travel schedules.\nParticipate in periodic sales evaluations and present territory performance metrics.\n\nRegional Brand Representation\n\nServe as the company's ambassador at local trade exhibitions, industry gatherings, and client consultations.\nCultivate a robust brand presence within the region through ethical behavior and professional interactions.\nEducate clients and prospects on the company's value proposition while upholding brand integrity.\n\nRequirements:\n- Fulfill all specified credentials and qualifications\n- Retain the identical job scope and obligations\n- Provide varied wording and structure\n- Present professional and captivating language\n- Maintain original salary, location, and contact details\n- Ensure content is detailed, thorough, and SEO-friendly\n- Create unique content for enhanced Google indexing",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Bachelor's degree in Business Administration, Marketing, or a related field.\n- A proven track record of 3 to 5 years in successful regional or territory sales within the energy and lubricants industry.\n- Possession of a valid driver's license.\n- Demonstrated history of consistently meeting or surpassing sales objectives.\n- Proficient in customer relationship management and adept at negotiation strategies.\n- Exceptional verbal and written communication skills, with strong presentation abilities and interpersonal acumen.\n- Self-driven, exceptionally organized, and capable of working autonomously.\n- Proficiency in utilizing MS Office Suite and CRM systems such as Salesforce, Zoho, and HubSpot.\n- Willingness to engage in frequent regional travel.\n- Openness to potential relocation or assignment to various locations nationwide.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 26,
      "date": "20 August 2025",
      "job_title": "MARKETING EXECUTIVE",
      "nature_of_job": "FULL TIME",
      "industry": "MARKETING",
      "salary": "KSHS. 30,000-40,000",
      "job_location": "RUIRU",
      "duties_and_responsibilities": "Engagement with Customers & Lead Nurturing\n\nServe as the primary contact point for customer inquiries across various communication channels such as phone calls, SMS, WhatsApp, emails, and social media platforms, particularly those originating from promotional efforts like radio advertisements.\nGather and record essential customer details, including but not limited to names, contact information, nature of inquiry, customer location, and specific preferences.\nManage a systematic customer relationship management (CRM) system or lead-tracking mechanism to facilitate efficient follow-up interactions and enhance conversion rates.\n\nPromotional Strategies & Marketing Initiatives\n\nDevise, implement, and oversee customized marketing campaigns aimed at showcasing the organization's services, properties, or ongoing ventures.\nCoordinate a blend of online (digital) and offline (traditional) marketing tactics, encompassing:\nSocial media engagement (Facebook, Instagram, LinkedIn, etc.)\nEmail promotions and mass text messaging\nRadio spots and print media placements\nCommunity events and promotional tours\n\nOnline Marketing & Content Development\n\nCreate and schedule engaging content for diverse social media platforms.\nTrack user interactions and address comments or inquiries on digital platforms promptly.\nEvaluate the performance of marketing campaigns and propose enhancements to maximize reach and engagement levels.\n\nSupport for Bids & Business Growth\n\nAid in the compilation of tender submissions by assembling:\nCorporate profile and background information\nCompliance certifications (such as NCA, KRA, Tax, etc.)\nPrevious project accomplishments and references\nOther mandatory and technical documentation\nCollaborate closely with technical teams to meet tender submission deadlines effectively.\n\nMarket Analysis & Performance Reporting\n\nConduct competitive assessments and gather market insights to shape strategic marketing endeavors.\nGenerate regular reports detailing lead generation metrics, campaign efficacy, and customer input on a weekly and monthly basis.\nOffer recommendations for campaign adjustments based on data-driven insights.\n\nRequirements:\n- Ensure adherence to specified qualifications and requirements\n- Retain the same job responsibilities and scope\n- Use varied wording and structure\n- Maintain a professional and captivating tone\n- Retain original salary, location, and contact details\n- Provide detailed and exhaustive information\n- Optimize content for SEO and ensure uniqueness for search engine indexing.",
      "key_requirements_skills_qualification": "Minimum of a Bachelor's degree in Marketing, Business Administration, Communication, or a closely related field\nDemonstrated track record of at least 24 months in a marketing or client-focused capacity—previous involvement within the construction or real estate industry is a plus\nProficiency in utilizing digital marketing solutions and Customer Relationship Management (CRM) platforms\nExemplary abilities in organization, communication, and fostering relationships\nProven aptitude for managing multiple tasks, meeting strict timelines, and operating independently\nExceptional focus on precision and meticulous attention to detail",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 27,
      "date": "20 August 2025",
      "job_title": "MARKETING EXECUTIVE",
      "nature_of_job": "FULL TIME",
      "industry": "MARKETING",
      "salary": "KSHS. 30,000-40,000",
      "job_location": "RUIRU",
      "duties_and_responsibilities": "Engaging with Customers & Managing Leads\n\nServe as the initial point of contact for customer queries across various communication channels such as phone calls, SMS, WhatsApp, emails, and social media, particularly those originating from promotional campaigns like radio ads.\nCollect and record essential customer details, including full names, contact information, nature of inquiry, customer location, and specific preferences.\nMaintain an efficient CRM system or lead-tracking mechanism to facilitate seamless follow-ups and enhance conversion rates.\n\nStrategizing Marketing Initiatives & Promotions\n\nDevise, implement, and oversee tailored marketing campaigns aimed at boosting visibility for the company’s services, properties, or ongoing ventures.\nManage both digital and traditional marketing approaches, encompassing:\nSocial media outreach (e.g., Facebook, Instagram, LinkedIn)\nEmail campaigns and mass text messaging\nRadio spots and print promotions\nCommunity engagement events and on-the-ground marketing efforts\n\nCrafting Digital Marketing Strategies & Content\n\nCreate and schedule engaging content for diverse social media platforms.\nMonitor audience interactions and promptly address comments or inquiries on online channels.\nEvaluate campaign performance metrics and propose enhancements to amplify reach and engagement.\n\nSupporting Tender Processes & Driving Business Growth\n\nAid in the compilation of tender documentation by assembling:\nCorporate profile and background information\nRegulatory compliance certifications (e.g., NCA, KRA, Tax documents)\nHistorical project data and client testimonials\nRelevant statutory and technical records\nCollaborate closely with technical teams to meet submission deadlines effectively.\n\nAnalyzing Market Trends & Generating Reports\n\nConduct competitive assessments and gather market insights to inform strategic marketing decisions.\nProduce regular reports on lead generation efficiency, campaign impact, and customer input on a weekly and monthly basis.\nRecommend modifications to marketing strategies based on data-driven insights.\n\nRequirements:\n- Must fulfill all specified qualifications and criteria\n- Retain the same job responsibilities and scope\n- Utilize distinct wording and structure\n- Maintain a professional and captivating tone\n- Salary, location, and contact details remain unchanged\n- Ensure comprehensive and detailed content\n- Optimize content for SEO and ensure uniqueness for search engine indexing",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n\n- Possess a Bachelor's degree or equivalent Diploma in Marketing, Business Administration, Communication, or a related discipline\n- Demonstrated track record of at least 2 years in a marketing or customer-centric capacity, with a preference for experience in the construction or real estate industry\n- Proficiency in utilizing digital marketing tools and Customer Relationship Management (CRM) systems\n- Exceptional organizational, communication, and interpersonal proficiencies\n- Ability to effectively juggle multiple tasks, adhere to deadlines, and operate autonomously\n- Meticulous attention to detail and unwavering commitment to precision",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 28,
      "date": "20 August 2025",
      "job_title": "ACCOUNTANT",
      "nature_of_job": "PART-TIME",
      "industry": "SALARY",
      "salary": "KSHS. 15,000",
      "job_location": "NAIROBI",
      "duties_and_responsibilities": "Responsibilities:\n- Maintain precise financial documentation encompassing ledgers, journals, and reconciliations to ensure accuracy.\n- Generate monthly financial statements, including profit and loss statements, balance sheets, and cash flow reports.\n- Ensure adherence to legal requirements such as PAYE, VAT, SHIF, NSSF, and timely submission on iTax.\n- Handle accounts payable and receivable, oversee invoicing, and pursue outstanding payments.\n- Supervise and control company budgets while aiding in forecasting activities.\n- Execute bank reconciliations and oversee petty cash management.\n- Utilize accounting software and Microsoft Excel for data input, analysis, and reporting purposes.\n- Assist in audits by furnishing necessary documentation and data.\n- Provide insights to management on cost management, financial strategy, and policy formulation.\n\nRequirements:\n- Thorough understanding of financial principles and practices.\n- Proficiency in accounting software and Microsoft Excel.\n- Strong analytical skills and attention to detail.\n- Ability to comply with statutory regulations and filing deadlines.\n- Excellent communication and interpersonal abilities.\n- Bachelor's degree in Accounting or Finance.\n- Relevant certification (e.g., CPA, ACCA) preferred.\n- Prior experience in financial reporting and analysis.\n- Familiarity with budgeting and forecasting processes.\n- Strong problem-solving skills and a proactive approach to tasks.\n\nThis revised version maintains the essence of the original job description while presenting the information in a unique and engaging manner.",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possess a Degree or Diploma in Accounting, Finance, or a related discipline\n- A CPA certification is highly preferred\n- Must have at least 2 years of hands-on experience in a dynamic accounting setting\n- Proficiency in utilizing accounting software such as QuickBooks, Sage, or similar platforms\n- Advanced proficiency in MS Excel, including expertise in VLOOKUP, Pivot Tables, and formulas\n- Demonstrated knowledge and comprehension of Kenyan tax regulations and statutory compliance protocols\n\nThese qualifications and requirements are designed to attract candidates with the necessary educational background, professional certifications, practical experience, technical skills, and legal acumen essential for excelling in this role.",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 29,
      "date": "20 August 2025",
      "job_title": "ACCOUNTANT",
      "nature_of_job": "PART-TIME",
      "industry": "SALARY",
      "salary": "KSHS. 15,000",
      "job_location": "NAIROBI",
      "duties_and_responsibilities": "Job Duties and Responsibilities:\n- Uphold precise financial documentation by maintaining accurate ledgers, journals, and reconciliations.\n- Generate monthly financial summaries, encompassing profit and loss statements, balance sheets, and cash flow statements.\n- Ensure adherence to statutory obligations such as PAYE, VAT, SHIF, NSSF, and timely submission on iTax.\n- Oversee accounts payable and receivable functions, including invoice management and pursuit of outstanding payments.\n- Supervise company budgets, contribute to forecasting activities, and implement budgetary controls.\n- Execute bank reconciliations and oversee petty cash management.\n- Employ accounting software and Microsoft Excel for data input, reporting, and analytical tasks.\n- Facilitate audits by furnishing necessary documentation and information to auditors.\n- Provide strategic guidance to management on cost containment, financial strategizing, and policy formulation.\n\nRequirements:\n- Proficient in maintaining financial records, ledgers, and reconciliations.\n- Demonstrated expertise in preparing monthly financial reports and statements.\n- Familiarity with statutory compliance regarding PAYE, VAT, SHIF, NSSF, and iTax regulations.\n- Experience in accounts payable, accounts receivable, and invoice processing.\n- Skilled in budget monitoring, forecasting, and financial analysis.\n- Competent in bank reconciliation procedures and petty cash management.\n- Proficiency in using accounting software and Microsoft Excel for financial tasks.\n- Ability to support audits through document preparation and information provision.\n- Strong communication skills for advising management on financial matters.",
      "key_requirements_skills_qualification": "Qualifications:\n- Possession of a Degree or Diploma in the field of Accounting, Finance, or a closely related discipline\n- Highly desirable to hold a CPA certification\n- At least 2 years of hands-on experience in a dynamic accounting environment\n- Proficiency in using various accounting software such as QuickBooks, Sage, or similar platforms\n- Expertise in utilizing advanced functions in MS Excel, including VLOOKUP, Pivot Tables, and complex formulas\n- Comprehensive knowledge of the legal framework surrounding Kenyan tax regulations and statutory compliance processes\n\nExperience and Qualifications:\n- Successful completion of a Degree or Diploma program in Accounting, Finance, or a related area\n- CPA certification would be considered a significant asset\n- Minimum of 2 years’ practical experience in a fast-paced accounting setting\n- Proficient in the utilization of accounting software like QuickBooks, Sage, or equivalent systems\n- Advanced proficiency in MS Excel with a strong grasp of VLOOKUP, Pivot Tables, and intricate formulas\n- Thorough understanding of the legalities concerning Kenyan tax laws and statutory compliance protocols",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 30,
      "date": "20 August 2025",
      "job_title": "CLEANER",
      "nature_of_job": "FULL TIME",
      "industry": "EDUCATION",
      "salary": "KSHS. 15,000",
      "job_location": "BURUBURU",
      "duties_and_responsibilities": "Job Duties and Responsibilities:\n- Perform daily cleaning and disinfection of classrooms, staff rooms, hallways, restrooms, and various school facilities.\n- Execute floor maintenance tasks including sweeping, mopping, scrubbing, vacuuming, and polishing as necessary.\n- Clean and sanitize furniture, desks, chairs, and equipment in educational and administrative areas.\n- Ensure proper waste disposal by emptying and sanitizing trash bins regularly.\n- Restock toiletries, cleaning supplies, and handwashing products in designated areas.\n- Conduct regular cleaning of windows, notice boards, and glass surfaces.\n- Promptly report any maintenance issues such as leaks, broken fixtures, or damaged furniture to the school administrator.\n- Safely operate and store all cleaning equipment and materials post each shift.\n- Provide assistance in setting up venues for school events or meetings when required.\n- Adhere to school health and safety protocols to uphold high hygiene standards consistently.\n\nRequirements:\n- Fulfill all specified qualifications and prerequisites.\n- Perform the same range of duties and responsibilities.\n- Utilize varied wording and format for improved uniqueness.\n- Maintain a professional and captivating tone.\n- Retain existing salary, location, and contact details.\n- Ensure content is detailed and exhaustive.\n- Optimize the content for SEO purposes to enhance search engine visibility.",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Possess a minimum of 2 years of demonstrated expertise in a similar cleaning capacity, with a preference for experience in educational or institutional settings\n- Proficient understanding of cleaning agents, equipment, and proper handling protocols\n- Demonstrated physical resilience and capability to execute repetitive duties\n- Flexibility to accommodate early morning and/or evening shifts as necessary\n- Demonstrated integrity, dependability, and capacity to work autonomously with limited oversight\n- Fundamental comprehension of hygiene and sanitation guidelines and standards",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    },
    {
      "id": 31,
      "date": "20 August 2025",
      "job_title": "CLEANER",
      "nature_of_job": "FULL TIME",
      "industry": "EDUCATION",
      "salary": "KSHS. 15,000",
      "job_location": "BURUBURU",
      "duties_and_responsibilities": "Job Duties and Responsibilities:\n- Perform daily cleaning and sanitization of classrooms, staffrooms, hallways, restrooms, and other school facilities.\n- Utilize various cleaning techniques such as sweeping, mopping, scrubbing, vacuuming, and polishing floors to maintain cleanliness.\n- Dust and sanitize furniture, desks, chairs, and equipment in educational and administrative areas.\n- Empty and sanitize trash receptacles, ensuring proper waste disposal procedures are followed.\n- Monitor and restock toiletries, cleaning supplies, and handwashing products in designated areas.\n- Regularly clean windows, notice boards, and glass surfaces to uphold a hygienic environment.\n- Promptly report any maintenance issues, including leaks, broken fixtures, or damaged furniture, to the school administration.\n- Safely operate and store cleaning equipment and materials after each shift.\n- Support in the setup of venues for school events or meetings when required.\n- Adhere to school health and safety protocols to uphold high hygiene standards consistently.\n\nRequirements:\n- Possess the necessary qualifications and meet specific job requirements.\n- Execute the defined job scope and responsibilities effectively.\n- Demonstrate proficiency in different cleaning methods and practices.\n- Maintain a professional and engaging demeanor while performing duties.\n- Uphold the established salary, location, and contact details.\n- Ensure comprehensive and detailed job content for SEO purposes.\n- Create unique and SEO-friendly content to enhance Google indexing.",
      "key_requirements_skills_qualification": "Qualifications and Requirements:\n- Demonstrated track record of at least 2 years in a related cleaning position, with a preference for experience within educational or institutional settings\n- Proficient understanding of cleaning agents, equipment, and proper handling protocols\n- Physical endurance and capacity to carry out repetitive duties\n- Flexibility to work early mornings and/or evenings as necessary\n- Possess a reputation for reliability, trustworthiness, and the ability to work autonomously with minimal oversight\n- Fundamental comprehension of hygiene standards and sanitation guidelines",
      "how_to_apply": "If you meet the above qualifications, skills and experience share CV on: hr@yourcompany.com\nInterviews will be carried out on a rolling basis until the position is filled.\nOnly the shortlisted candidates will be contacted."
    }
  ]
}